AccumulationRegisters/Продажи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>Продажи</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Comment>Количество проданного товара</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Comment>Сумма с учетом налогов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДС</Name>
					<Comment>Сумма НДС в валюте регл. учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаСкидки</Name>
					<Comment>Сумма скидки в валюте регл. учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаУпр</Name>
					<Comment>Сумма упр. учета с учетом налогов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Себестоимость</Name>
					<Comment>Себестоимость регл. учета с учетом налогов но без доп. расходов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДСВходящий</Name>
					<Comment>Сумма входящего НДС в валюте регл. учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СебестоимостьУпр</Name>
					<Comment>Себестоимость упр. учета с учетом налогов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаАкциза</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПодразделениеКомпании</Name>
					<Comment>Подразделение компании в котором был зафиксирован факт продажи товара</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТорговаяПлощадка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТорговыеПлощадки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СкладКомпании</Name>
					<Comment>Склад компании</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладыКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>Проданный товар или оказанная услуга</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Comment>Характеристика номенклатуры</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХозОперация</Name>
					<Comment>Хозяйственная операция</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КлассификаторПродажи</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторПродаж</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Поставщик</Name>
					<Comment>Поставщик у которого товар был куплен</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Покупатель</Name>
					<Comment>Покупатель который купил товар или которому была оказана услуга</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДоговорВзаиморасчетов</Name>
					<Comment>Договор взаиморасчетов с покупателем</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Comment>Ставка НДС</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатусПартии</Name>
					<Comment>Статус партии, определяющий, чей товар мы продали (собственный компанией или принятый на комиссию)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПартий</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Comment>Партия</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ТипыПартий</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/ТК_Планирование.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ТК_Планирование</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Comment>Выполняемая документом операция</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НоменклатураПланирования</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ТК_ТипыПланирования</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Показатель</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТК_ПоказательПланирования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ТК_ПоказательПланирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ТК_ПоказательПланирования</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Продажи_Сумма</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Продажи_Вес</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Маржа_Прибыль</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Маржа_Процент</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/ТК_PowerBi_РаботаHTTP_Сервис/Ext/Module.bsl
Функция ПолучитьЕжедневныйОтчетФабрикаСыра(Дата = Неопределено) Экспорт 
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Не ЗначениеЗаполнено(Дата) Тогда 
		Дата = КонецДня(ТекущаяДата() - 60*60*24);
	КонецЕсли;	
	
	МассивИсключений = Новый Массив;
	МассивИсключений.Добавить(Справочники.НоменклатурныеГруппы.НайтиПоКоду("000000050")); //Тара и этикетка
	МассивИсключений.Добавить(Справочники.НоменклатурныеГруппы.НайтиПоКоду("000000054")); //Сахар
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("ПодразделениеКомпании", Справочники.ПодразделенияКомпании.ПолучитьСсылку(Новый УникальныйИдентификатор("aca6e0b8-d29a-11e6-80d2-0050569272d9")));
	Запрос.УстановитьПараметр("МассивИсключений", МассивИсключений);
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	НАЧАЛОПЕРИОДА(Продажи.Период, ДЕНЬ) КАК Период,
	               |	""ПоДням"" КАК ТипПериода,
	               |	Продажи.Номенклатура.ГруппаДляБухгалтерии КАК ГруппаНоменклатуры,
	               |	СУММА(ВЫБОР
	               |			КОГДА Продажи.Номенклатура.ОсновнаяЕдиницаИзмерения.Коэффициент ЕСТЬ NULL
	               |				ТОГДА 0
	               |			КОГДА Продажи.Номенклатура.ОсновнаяЕдиницаИзмерения.Коэффициент <= 1
	               |				ТОГДА Продажи.Количество * Продажи.Номенклатура.ОсновнаяЕдиницаИзмерения.Вес
	               |			ИНАЧЕ Продажи.Количество / Продажи.Номенклатура.ОсновнаяЕдиницаИзмерения.Коэффициент * Продажи.Номенклатура.ОсновнаяЕдиницаИзмерения.Вес
	               |		КОНЕЦ) КАК Вес,
	               |	СУММА(Продажи.Сумма) КАК Сумма,
	               |	СУММА(Продажи.Сумма - Продажи.СуммаНДС - (Продажи.Себестоимость - Продажи.СуммаНДСВходящий)) КАК Прибыль,
	               |	СУММА(Продажи.СуммаНДС) КАК СуммаНДС,
	               |	NULL КАК Маржа
	               |ПОМЕСТИТЬ ВТ
	               |ИЗ
	               |	РегистрНакопления.Продажи КАК Продажи
	               |ГДЕ
	               |	Продажи.Период МЕЖДУ НАЧАЛОПЕРИОДА(&Дата, МЕСЯЦ) И КОНЕЦПЕРИОДА(&Дата, ДЕНЬ)
	               |	И Продажи.ПодразделениеКомпании = &ПодразделениеКомпании
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Продажи.Номенклатура.ГруппаДляБухгалтерии,
	               |	НАЧАЛОПЕРИОДА(Продажи.Период, ДЕНЬ)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	НАЧАЛОПЕРИОДА(Продажи.Период, МЕСЯЦ),
	               |	""ПредМесяц"",
	               |	Продажи.Номенклатура.ГруппаДляБухгалтерии,
	               |	СУММА(ВЫБОР
	               |			КОГДА Продажи.Номенклатура.ОсновнаяЕдиницаИзмерения.Коэффициент ЕСТЬ NULL
	               |				ТОГДА 0
	               |			КОГДА Продажи.Номенклатура.ОсновнаяЕдиницаИзмерения.Коэффициент <= 1
	               |				ТОГДА Продажи.Количество * Продажи.Номенклатура.ОсновнаяЕдиницаИзмерения.Вес
	               |			ИНАЧЕ Продажи.Количество / Продажи.Номенклатура.ОсновнаяЕдиницаИзмерения.Коэффициент * Продажи.Номенклатура.ОсновнаяЕдиницаИзмерения.Вес
	               |		КОНЕЦ),
	               |	СУММА(Продажи.Сумма),
	               |	СУММА(Продажи.Сумма - Продажи.СуммаНДС - (Продажи.Себестоимость - Продажи.СуммаНДСВходящий)),
	               |	СУММА(Продажи.СуммаНДС),
	               |	NULL
	               |ИЗ
	               |	РегистрНакопления.Продажи КАК Продажи
	               |ГДЕ
	               |	Продажи.Период МЕЖДУ НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(&Дата, МЕСЯЦ, -1), МЕСЯЦ) И КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(&Дата, МЕСЯЦ, -1), МЕСЯЦ)
	               |	И Продажи.ПодразделениеКомпании = &ПодразделениеКомпании
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Продажи.Номенклатура.ГруппаДляБухгалтерии,
	               |	НАЧАЛОПЕРИОДА(Продажи.Период, МЕСЯЦ)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	НАЧАЛОПЕРИОДА(Продажи.Период, МЕСЯЦ),
	               |	""ПредГод"",
	               |	Продажи.Номенклатура.ГруппаДляБухгалтерии,
	               |	СУММА(ВЫБОР
	               |			КОГДА Продажи.Номенклатура.ОсновнаяЕдиницаИзмерения.Коэффициент ЕСТЬ NULL
	               |				ТОГДА 0
	               |			КОГДА Продажи.Номенклатура.ОсновнаяЕдиницаИзмерения.Коэффициент <= 1
	               |				ТОГДА Продажи.Количество * Продажи.Номенклатура.ОсновнаяЕдиницаИзмерения.Вес
	               |			ИНАЧЕ Продажи.Количество / Продажи.Номенклатура.ОсновнаяЕдиницаИзмерения.Коэффициент * Продажи.Номенклатура.ОсновнаяЕдиницаИзмерения.Вес
	               |		КОНЕЦ),
	               |	СУММА(Продажи.Сумма),
	               |	СУММА(Продажи.Сумма - Продажи.СуммаНДС - (Продажи.Себестоимость - Продажи.СуммаНДСВходящий)),
	               |	СУММА(Продажи.СуммаНДС),
	               |	NULL
	               |ИЗ
	               |	РегистрНакопления.Продажи КАК Продажи
	               |ГДЕ
	               |	Продажи.Период МЕЖДУ НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(&Дата, ГОД, -1), МЕСЯЦ) И КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(&Дата, ГОД, -1), МЕСЯЦ)
	               |	И Продажи.ПодразделениеКомпании = &ПодразделениеКомпании
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Продажи.Номенклатура.ГруппаДляБухгалтерии,
	               |	НАЧАЛОПЕРИОДА(Продажи.Период, МЕСЯЦ)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	НАЧАЛОПЕРИОДА(ТК_Планирование.Период, МЕСЯЦ),
	               |	""Бюджет"",
	               |	ТК_Планирование.НоменклатураПланирования,
	               |	СУММА(ВЫБОР
	               |			КОГДА ТК_Планирование.Показатель = ЗНАЧЕНИЕ(Перечисление.ТК_ПоказательПланирования.Продажи_Вес)
	               |				ТОГДА ТК_Планирование.Значение
	               |			ИНАЧЕ 0
	               |		КОНЕЦ),
	               |	СУММА(ВЫБОР
	               |			КОГДА ТК_Планирование.Показатель = ЗНАЧЕНИЕ(Перечисление.ТК_ПоказательПланирования.Продажи_Сумма)
	               |				ТОГДА ТК_Планирование.Значение
	               |			ИНАЧЕ 0
	               |		КОНЕЦ),
	               |	СУММА(ВЫБОР
	               |			КОГДА ТК_Планирование.Показатель = ЗНАЧЕНИЕ(Перечисление.ТК_ПоказательПланирования.Маржа_Прибыль)
	               |				ТОГДА ТК_Планирование.Значение
	               |			ИНАЧЕ 0
	               |		КОНЕЦ),
	               |	NULL,
	               |	СУММА(ВЫБОР
	               |			КОГДА ТК_Планирование.Показатель = ЗНАЧЕНИЕ(Перечисление.ТК_ПоказательПланирования.Маржа_Процент)
	               |				ТОГДА ТК_Планирование.Значение
	               |			ИНАЧЕ 0
	               |		КОНЕЦ)
	               |ИЗ
	               |	РегистрСведений.ТК_Планирование КАК ТК_Планирование
	               |ГДЕ
	               |	ТК_Планирование.Регистратор.ПодразделениеКомпании = &ПодразделениеКомпании
	               |	И ТК_Планирование.Период = НАЧАЛОПЕРИОДА(&Дата, МЕСЯЦ)
	               |	И ТК_Планирование.НоменклатураПланирования ССЫЛКА Справочник.НоменклатурныеГруппы
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	НАЧАЛОПЕРИОДА(ТК_Планирование.Период, МЕСЯЦ),
	               |	ТК_Планирование.НоменклатураПланирования
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПРЕДСТАВЛЕНИЕ(ВТ.ГруппаНоменклатуры) КАК ГруппаНоменклатуры,
	               |	ВТ.Период КАК Период,
	               |	ВТ.ТипПериода КАК ТипПериода,
	               |	ЕСТЬNULL(ВТ.Вес, 0) КАК Вес,
	               |	ЕСТЬNULL(ВТ.Сумма, 0) КАК Сумма,
	               |	ЕСТЬNULL(ВТ.Прибыль, 0) КАК Прибыль,
	               |	ЕСТЬNULL(ВТ.СуммаНДС, 0) КАК СуммаНДС,
	               |	ЕСТЬNULL(ВТ.Маржа, 0) КАК Маржа
	               |ИЗ
	               |	ВТ КАК ВТ
	               |ГДЕ
	               |	НЕ ВТ.ГруппаНоменклатуры В (&МассивИсключений)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	МассивОтвета = Новый Массив;
	Пока Выборка.Следующий() Цикл 
		СтрокаОтвета = Новый Структура("Период,ГруппаНоменклатуры,ТипПериода,Вес,Сумма,СуммаНДС,Прибыль,Маржа");
		ЗаполнитьЗначенияСвойств(СтрокаОтвета, Выборка);
		
		МассивОтвета.Добавить(СтрокаОтвета);
	КонецЦикла;
	
	Возврат МассивОтвета;
	
КонецФункции

Функция ПолучитьДанныеОтчетаPowerBi(ИмяОтчета, ДопПараметры, ВсеОк = Истина, Описание = "") Экспорт 
	
	Параметры = Новый Структура;
	Параметры.Вставить("Действие", ИмяОтчета);
	
	Если ЗначениеЗаполнено(ДопПараметры) Тогда 
		Параметры.Вставить("ДопПараметры", ДопПараметры);
	КонецЕсли;
		
	КодСостояния = 200;
	ТелоОтчета = "";
	
	Результат = ТК_ОбменДаннымиСервер.ПолучитьРезультатДополнительнойОбработки("ДанныеДляВнешнихЗапросов", "ПолучитьДанные", Параметры, ВсеОк, Описание);
	
	Если ТипЗнч(Результат) = Тип("Структура") Тогда 
		ДанныеОтчета = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Результат, "ДанныеОтчета", Неопределено);
		
		Если ВсеОк И ЗначениеЗаполнено(ДанныеОтчета) Тогда 
			ЗаписьJSON = Новый ЗаписьJSON;
			ЗаписьJSON.УстановитьСтроку();
			ЗаписатьJSON(ЗаписьJSON, ДанныеОтчета);
			ТелоОтчета = ЗаписьJSON.Закрыть();	
		Иначе
			Если Не ПустаяСтрока(Описание) Тогда 
				ТелоОтчета = Описание;
			КонецЕсли;
		КонецЕсли;
		
		Если Результат.Свойство("КодСостояния") Тогда 
			КодСостояния = Результат.КодСостояния;
		Иначе
			Если Не ВсеОк Тогда 
				КодСостояния = 500;
			КонецЕсли;
		КонецЕсли;
	Иначе
		Если Не ВсеОк Тогда 
			КодСостояния = 500;	
		КонецЕсли;				
	КонецЕсли;	
	
	Если Не ЗначениеЗаполнено(ТелоОтчета) Тогда 
		ТелоОтчета = НСтр("ru = 'Данные не получены'; uk = 'Дані не отримані'");
	КонецЕсли;
	
	Возврат Новый Структура("КодСостояния, ТелоОтчета", КодСостояния, ТелоОтчета); 
	
КонецФункции
